Autodesk.Revit.DB.Wall.IsValidTargetAttachment(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Says whether the element id can be used as a target for a new attachment.
Remarks:
Valid targets are roofs, floors, ceilings, toposolids, or other walls.
doc:
Current Revit document.
targetId:
A proposed target element id for a wall attachment.
Returns:
Returns true if the element id can be used as a target for a new attachment, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025.2

Autodesk.Revit.DB.Wall.RemoveAttachment(Autodesk.Revit.DB.ElementId)
Removes any attachment of the wall to the specified target.
targetId:
Target element id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025.2

Autodesk.Revit.DB.Wall.RemoveAttachment(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.AttachmentLocation)
Removes an attachment at the top or base of a wall, if there is one.
targetId:
Target element id.
attachmentLocation:
The attachment location.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025.2

Autodesk.Revit.DB.Wall.AddAttachment(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.AttachmentLocation)
Attaches the wall to the target. If an attachment already
exists with the same "attachmentLocation" value, an exception is thrown.
The target should be a roof, floor, ceiling, toposolid, or other wall.
targetId:
Target element id.
attachmentLocation:
The attachment location.
Throws Autodesk.Revit.Exceptions.ArgumentException:
-or-
wall already has an attachment to targetId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025.2

Autodesk.Revit.DB.Wall.GetAttachmentIds(Autodesk.Revit.DB.AttachmentLocation)
Gets the ids of the target elements that are attached to the Wall.
attachmentLocation:
The attachment location.
Returns:
Returns the elements ids that are attached to this wall at the specified "attachmentLocation".
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025.2

Autodesk.Revit.DB.Wall.IsWrappingAtLocationAllowed(System.Int32)
If end wrapping is allowed at the location.
Remarks:
If Wrapping At Ends in wall type is set to none, this function returns false
If the location is invalid, for example: wall doesn't have this location or the location is joined, this function returns false
else check if that location is allowed.
locationIndex:
0 or 1 represents wall's end, other number represents the wrapping locations on vertical faces of openings or profiles.
Returns:
true if it is allowed, false if it is disallowed.
Since:
2025

Autodesk.Revit.DB.Wall.DisallowWrappingAtLocation(System.Int32)
Disallow end wrapping at the location.
Remarks:
If Wrapping At Ends in wall type is set to none, this function does nothing.
If the location is invalid, for example: wall doesn't have this location or the location is joined, this function throws ArgumentException.
locationIndex:
0 or 1 represents wall's end, other number represents the wrapping locations on vertical faces of openings or profiles.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This location is invalid for wrapping.
Since:
2025

Autodesk.Revit.DB.Wall.AllowWrappingAtLocation(System.Int32)
Allow end wrapping at the location.
Remarks:
If Wrapping At Ends in wall type is set to none, this function throws InvalidOperationException
If the location is invalid, for example: wall doesn't have this location or the location is joined, this function throws ArgumentException.
locationIndex:
0 or 1 represents wall's end, other number represents the wrapping locations on vertical faces of openings or profiles.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This location is invalid for wrapping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
End wrapping is disabled in wall type.
Since:
2025

Autodesk.Revit.DB.Wall.GetValidWrappingLocationIndices
Gets all valid locations for end wrapping.
Remarks:
All valid wrapping locations include wall's two ends and locations on vertical faces of openings or profiles without join.
Returns:
The list of valid wrapping locations.
Since:
2025

Autodesk.Revit.DB.Wall.GetWrappingLocationAsCurveParameter(System.Int32)
Gets the non-normalized (actual) curve parameter of the location.
Remarks:
If the location is invalid, for example: wall doesn't have this location or the location is joined, this function throws ArgumentException.
locationIndex:
0 or 1 represents wall's end, other number represents the wrapping locations on vertical faces of openings or profiles.
Returns:
The non-normalized (actual) curve parameter value on the curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This location is invalid for wrapping.
Since:
2025

Autodesk.Revit.DB.Wall.GetWrappingLocationAsReferences(System.Int32)
Gets an array of references to faces at the location.
Remarks:
If the location is invalid, for example: wall doesn't have this location or the location is joined, this function throws ArgumentException.
This function may return not only one face, for example: after editing profile, some aligned vertical faces have same location on curve.
locationIndex:
0 or 1 represents wall's end, other number represents the wrapping locations on vertical faces of openings or profiles.
Returns:
All faces' references at the location.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This location is invalid for wrapping.
Since:
2025

Autodesk.Revit.DB.Wall.Flip
The wall orientation will be flipped.
Remarks:
For curtain walls and stacked walls, flip won't change the wall orientation. Autodesk::Revit::DB::Wall.Orientation.

Autodesk.Revit.DB.Wall.Orientation
The outward-facing normal vector of the exterior side face at the starting point of the wall.
Remarks:
For curtain walls and stacked walls, the wall itself doesn't have exterior and interior side faces.
Therefore, in both cases, the wall's orientation is not changed when it is flipped. However, flipping curtain walls or stacked walls will change the orientations of their sub-walls.
In the case of curtain walls, sub-walls are present when a curtain panel type is changed to a wall.

Autodesk.Revit.DB.Wall.CrossSection
Gets or sets the Cross-section for this wall.
Remarks:
This value determines whether the wall is vertical, slanted or tapered. See also: Autodesk.Revit.DB.WallCrossSection.
Setting the value to "SingleSlanted" or "Tapered" will enable other parameters to control the slanted angle(s) for a slanted or a tapered wall.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The current wall does not support the cross section wallCrossSection.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022